#+title: MM5016 Lab 5
#+description: Gaussian elimination with pivot
#+PROPERTY: header-args :tangle ./lab5.py :padline 2

**** test av allt ovanför
#+begin_src python :results output :session :tangle no
print(matrix_multiply([[1,0],[0,1]], [[3],[4]]))
print(create_identity(3))
print(switch(0,1,3))
print(add_multiple_of_row_to_other_row(3,0,1,3))
print(matrix_multiply(scale_row(3,1,3), [[1,2,3],[4,5,6],[7,8,9]]))
mat = [[1,2,3], [4,5,6], [7,8,9]]
print(mat)
print(transpose(mat))
#+end_src

#+RESULTS:
: [[3], [4]]
: [[1, 0, 0], [0, 1, 0], [0, 0, 1]]
: [[0, 1, 0], [1, 0, 0], [0, 0, 1]]
: [[1, 0, 0], [3, 1, 0], [0, 0, 1]]
: [[1, 2, 3], [12, 15, 18], [7, 8, 9]]
: [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
: [[1, 4, 7], [2, 5, 8], [3, 6, 9]]

**** test: find next gaussian elimination task
#+begin_src python :results output :session :tangle no
print(find_next_gaussian_elimination_task([[1,0],[0,1]]))
#+end_src

#+RESULTS:
: ((-1, -1), 'finnished')

**** Gaussian elimination test
#+begin_src python :results output :session :tangle no
matrix = [[-3,-8,-5],[1,4,3],[6,10,-5]]
vector = [[1],[2],[6]]
result = gaussian_elimination(matrix, vector)
print(result)
print(matrix_multiply(matrix, result))
#+end_src

#+RESULTS:
: [[-7.0555555555555545], [3.8055555555555554], [-2.0555555555555554]]
: [[0.9999999999999982], [2.0000000000000018], [6.000000000000005]]



* Test
#+begin_src python :results output :session :tangle no
id2 = np.array([[1,0],[0,1]])
id3 = np.matrix('1 0 0; 0 1 0; 0 0 1')
vec = np.array([-1,3])
vec3 = np.transpose(np.array([1,2,3]))
print (id2 @ vec)
print(vec3)
print (id3 @ vec3)
#+end_src

#+RESULTS:
: [-1  3]
: [1 2 3]
: [[1 2 3]]
